tap "armmbed/formulae"
tap "homebrew/bundle"
tap "stripe/stripe-cli"
brew "git"
brew "asdf"
brew "cocoapods"
brew "gh"
brew "mas"
brew "mise"
brew "sheldon"
brew "starship"
brew "stow"
brew "vips"
brew "zsh"
brew "stripe/stripe-cli/stripe"
cask "android-studio"
cask "discord"
cask "docker-desktop"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "logi-options+"
cask "raycast"
cask "realforce"
cask "tableplus"
cask "visual-studio-code"
cask "zed"
mas "Xcode", id: 497799835
vscode "anthropic.claude-code"
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "expo.vscode-expo-tools"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "oderwat.indent-rainbow"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "saoudrizwan.claude-dev"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "vitest.explorer"
vscode "wix.vscode-import-cost"
