# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Fast, configurable, shell plugin manager
brew "sheldon"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Command-line tool for Stripe
brew "stripe-cli"
# Image processing library
brew "vips"
# Generate your Xcode project from a spec file and your folder structure
brew "xcodegen"
# UNIX shell (command interpreter)
brew "zsh"
# Tools for building Android applications
cask "android-studio"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Software for Logitech devices
cask "logi-options+"
# Control your tools with a few keystrokes
cask "raycast"
# Software for Realforce keyboards and mice
cask "realforce"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Native GUI tool for relational databases
cask "tableplus"
# Open-source code editor
cask "visual-studio-code"
# Multiplayer code editor
cask "zed"
mas "Xcode", id: 497799835
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "docker.docker"
vscode "eamodio.gitlens"
vscode "expo.vscode-expo-tools"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "vitest.explorer"
vscode "wix.vscode-import-cost"
npm "corepack"
