tap "armmbed/formulae"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
brew "asdf"
brew "gh"
brew "git"
brew "mas"
brew "mise"
brew "sheldon"
brew "starship"
brew "stow"
brew "vips"
brew "zsh"
cask "1password"
cask "discord"
cask "docker"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "logi-options+"
cask "raycast"
cask "realforce"
cask "visual-studio-code"
cask "zed"
mas "Xcode", id: 497799835
vscode "bierner.markdown-preview-github-styles"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "hashicorp.terraform"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ja"
vscode "oderwat.indent-rainbow"
vscode "prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "streetsidesoftware.code-spell-checker"
vscode "tamasfe.even-better-toml"
vscode "wix.vscode-import-cost"
